bearxiong99/SmartCityLighting/Firmware/src/ti/source/ti/devices/cc26x0r2/inc/hw_aux_wuc.h
/******************************************************************************
*  Filename:       hw_aux_wuc_h
*  Revised:        2016-05-03 09:51:53 +0200 (Tue, 03 May 2016)
*  Revision:       46239
*
* Copyright (c) 2015 - 2016, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_WUC_H__
#define __HW_AUX_WUC_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_WUC component
//
//*****************************************************************************
// Module Clock Enable
#define AUX_WUC_O_MODCLKEN0                                         0x00000000

// Power Off Request
#define AUX_WUC_O_PWROFFREQ                                         0x00000004

// Power Down Request
#define AUX_WUC_O_PWRDWNREQ                                         0x00000008

// Power Down Acknowledgment
#define AUX_WUC_O_PWRDWNACK                                         0x0000000C

// Low Frequency Clock Request
#define AUX_WUC_O_CLKLFREQ                                          0x00000010

// Low Frequency Clock Acknowledgment
#define AUX_WUC_O_CLKLFACK                                          0x00000014

// Wake-up Event Flags
#define AUX_WUC_O_WUEVFLAGS                                         0x00000028

// Wake-up Event Clear
#define AUX_WUC_O_WUEVCLR                                           0x0000002C

// ADC Clock Control
#define AUX_WUC_O_ADCCLKCTL                                         0x00000030

// TDC Clock Control
#define AUX_WUC_O_TDCCLKCTL                                         0x00000034

// Reference Clock Control
#define AUX_WUC_O_REFCLKCTL                                         0x00000038

// Real Time Counter Sub Second Increment 0
#define AUX_WUC_O_RTCSUBSECINC0                                     0x0000003C

// Real Time Counter Sub Second Increment 1
#define AUX_WUC_O_RTCSUBSECINC1                                     0x00000040

// Real Time Counter Sub Second Increment Control
#define AUX_WUC_O_RTCSUBSECINCCTL                                   0x00000044

// MCU Bus Control
#define AUX_WUC_O_MCUBUSCTL                                         0x00000048

// MCU Bus Status
#define AUX_WUC_O_MCUBUSSTAT                                        0x0000004C

// AON Domain Control Status
#define AUX_WUC_O_AONCTLSTAT                                        0x00000050

// AUX Input Output Latch
#define AUX_WUC_O_AUXIOLATCH                                        0x00000054

// Module Clock Enable 1
#define AUX_WUC_O_MODCLKEN1                                         0x0000005C

//*****************************************************************************
//
// Register: AUX_WUC_O_MODCLKEN0
//
//*****************************************************************************
// Field:     [7] AUX_ADI4
//
// Enables (1) or disables (0) clock for AUX_ADI4.
// ENUMs:
// EN                       System CPU has requested clock for AUX_ADI4
// DIS                      System CPU has not requested clock for AUX_ADI4
#define AUX_WUC_MODCLKEN0_AUX_ADI4                                  0x00000080
#define AUX_WUC_MODCLKEN0_AUX_ADI4_BITN                                      7
#define AUX_WUC_MODCLKEN0_AUX_ADI4_M                                0x00000080
#define AUX_WUC_MODCLKEN0_AUX_ADI4_S                                         7
#define AUX_WUC_MODCLKEN0_AUX_ADI4_EN                               0x00000080
#define AUX_WUC_MODCLKEN0_AUX_ADI4_DIS                              0x00000000

// Field:     [6] AUX_DDI0_OSC
//
// Enables (1) or disables (0) clock for AUX_DDI0_OSC.
// ENUMs:
// EN                       System CPU has requested clock for AUX_DDI0_OSC
// DIS                      System CPU has not requested clock for
//                          AUX_DDI0_OSC
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC                              0x00000040
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_BITN                                  6
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_M                            0x00000040
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_S                                     6
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_EN                           0x00000040
#define AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_DIS                          0x00000000

// Field:     [5] TDC
//
// Enables (1) or disables (0) clock for AUX_TDCIF.
//
// Note that the TDC counter and reference clock sources must be requested
// separately using TDCCLKCTL and REFCLKCTL, respectively.
// ENUMs:
// EN                       System CPU has requested clock for TDC
// DIS                      System CPU has not requested clock for TDC
#define AUX_WUC_MODCLKEN0_TDC                                       0x00000020
#define AUX_WUC_MODCLKEN0_TDC_BITN                                           5
#define AUX_WUC_MODCLKEN0_TDC_M                                     0x00000020
#define AUX_WUC_MODCLKEN0_TDC_S                                              5
#define AUX_WUC_MODCLKEN0_TDC_EN                                    0x00000020
#define AUX_WUC_MODCLKEN0_TDC_DIS                                   0x00000000

